


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ПВидНомеклатуры = Перечисления.ВидНоменклатуры.Товар;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыТоварОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Для Каждого строка из Объект.Товары Цикл 
		Если строка.Товар = ВыбранноеЗначение Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Этот товар уже есть в списке товаров!";
			Сообщение.УстановитьДанные(строка);
			Сообщение.Поле("Номенклатура");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульПокупкиВызовСервера.ПолучитьЕд_измПоСсылкеНаТовар(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = Текст*ТекущиеДанные.Количество;
	ПересчетСуммыДокумента()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанныые = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныые.Сумма = Текст*ТекущиеДанныые.Цена;
	ПересчетСуммыДокумента();
КонецПроцедуры

//Обработка фильтрации Номенклатуры по виду номенклатуры при выборе Товара
&НаКлиенте
Процедура ТоварыТоварНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора =  Новый Структура("Ссылка",ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНомеклатуры));
	ПараметрыФормы = Новый Структура("Отбор",ЗначениеОтбора);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если СтрДлина(Текст)>2 Тогда 
		ДанныеВыбора = Новый СписокЗначений();
		СписокТоваров = ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНомеклатуры,"%" +Текст + "%");
		ДанныеВыбора.ЗагрузитьЗначения(СписокТоваров);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПересчетСуммыДокумента()
	 СумммаДокумента =0;
	Для каждого товар из Объект.Товары Цикл 
		СумммаДокумента= СумммаДокумента + товар.Сумма;
	КонецЦикла;
	Объект.СумммаДокумента = СумммаДокумента;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции




#КонецОбласти
