// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	СтандартнаяОбработка= Ложь;
//
//	Элементы.Список.ВыборГруппИЭлементов = Параметры.ВыборГруппИЭлементов;
//	Элементы.Список.РазрешитьВыборКорня = Параметры.РазрешитьВыборКорня;
//	Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
//	
//	Параметры.Отбор = Параметры.Отбор;
//	Параметры.ВыборГруппИЭлементов= ИспользованиеГруппИЭлементов.Элементы;
//	Параметры.РазрешитьВыборКорня= Параметры.РазрешитьВыборКорня;
//	Параметры.РежимВыбора = Истина;
	
	
	//Если  Параметры.ПоказатьТовары Тогда 
	//	ФормаВыбора.Параметры.РежимВыбора = Истина;
 	//	ФормаВыбора.Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	//	ФормаВыбора.Параметры.РазрешитьВыборКорня = Ложь;
	//КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
