// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидыОпераций") Тогда 
		Для Каждого элемент из Параметры.ВидыОпераций Цикл 
			//@skip-check typed-value-adding-to-untyped-collection
			ЭтотОбъект.ВидыОперацийСписок.Добавить(элемент);			
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
