


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ПВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуга;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	Для Каждого строка из Объект.Услуги Цикл
		Если  строка.Услуга = ВыбранноеЗначение Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Услуга с таким наименованием уже в списке!";
			Сообщение.УстановитьДанные(строка);
			Сообщение.Поле("Услуга");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульПокупкиВызовСервера.ПолучитьЕд_измПоСсылкеНаТовар(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора =  Новый Структура("Ссылка",ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНоменклатуры));
		ПараметраФормы  = Новый Структура("Отбор",ЗначениеОтбора);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметраФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	Если СтрДлина(Текст)>2 Тогда
		 	ДанныеВыбора = Новый СписокЗначений();
		 	СписокУслуг = ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНоменклатуры,"%"+Текст+"%" );
		 	ДанныеВыбора.ЗагрузитьЗначения(СписокУслуг);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
