// @strict-types


#Область ПрограммныйИнтерфейс
//@skip-check method-param-value-type
Процедура ЗаполнитьМассивУникальнымиЗначениями(МассивПриемник, МассивИсточник) Экспорт
	
	//@skip-check variable-value-type
	Для Каждого Элемент Из МассивИсточник Цикл
		
		//@skip-check dynamic-access-method-not-found
		Если МассивПриемник.Найти(Элемент) = Неопределено Тогда
			
			//@skip-check typed-value-adding-to-untyped-collection
			МассивПриемник.Добавить(Элемент);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
