


#Область ПрограммныйИнтерфейс

Функция ПолучитьНоменклатуруПоКонтрагенту(Знач ВидКонтрагаента, Знач НаименованиеКонтрагента = "") Экспорт

	Запрос = НовыЙ Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Контрагент.ВидКотрагента = &ВидКонтрагаента
	|	И ДЛИНАСТРОКИ(&НаименованиеКонтрагента) <> 0
	|	И Номенклатура.Контрагент.Наименование ПОДОБНО &НаименованиеКонтрагента
	|	ИЛИ Номенклатура.Контрагент.ВидКотрагента = &ВидКонтрагаента
	|	И ДЛИНАСТРОКИ(&НаименованиеКонтрагента) = 0";
	Запрос.УстановитьПараметр("ВидКонтрагаента", ВидКонтрагаента);
	Запрос.УстановитьПараметр("НаименованиеКонтрагента", НаименованиеКонтрагента);
	Выборка = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат  Выборка;
КонецФункции
Функция ПолучитьНоменклатуру(Знач ВидНомеклатуры, Знач Наименование = "") Экспорт

	Запрос = НовыЙ Запрос();

	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(Номенклатура.ВидНоменклатуры = &ВидНомеклатуры
	|	И ДЛИНАСТРОКИ(&Наименование) <> 0
	|	И Номенклатура.Наименование ПОДОБНО &Наименование) 
	|	ИЛИ
	|	(Номенклатура.ВидНоменклатуры = &ВидНомеклатуры 
	|	И ДЛИНАСТРОКИ(&Наименование) = 0)";

	Запрос.УстановитьПараметр("ВидНомеклатуры", ВидНомеклатуры);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат  Выборка;
КонецФункции

Функция ПолучитьКонтрагенты(Знач ВидКотрагента, Знач Наименование = "") Экспорт

	Запрос = НовыЙ Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	(Контрагенты.ВидКотрагента = &ВидКотрагента
	|	И ДЛИНАСТРОКИ(&Наименование) <> 0
	|	И Контрагенты.Наименование ПОДОБНО &Наименование) 
	|	ИЛИ
	|	(Контрагенты.ВидКотрагента = &ВидКотрагента 
	|	И ДЛИНАСТРОКИ(&Наименование) = 0)";

	Запрос.УстановитьПараметр("ВидКотрагента", ВидКотрагента);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат  Выборка;
КонецФункции

Функция ПолучитьЕд_измПоСсылкеНаТовар(Знач Товар) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка",Товар.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда 
		ЕдИзм= Выборка.ЕдиницаИзмерения;
		Возврат  ЕдИзм;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСсылкуНаСправочник(Параметры) Экспорт
	Возврат Неопределено; 
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
