


#Область ПрограммныйИнтерфейс

Функция НоменклатураПоВиду(Знач ВидНоменклатуры, Знач Наименование = "") Экспорт

	Запрос = НовыЙ Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И ДЛИНАСТРОКИ(&Наименование) <> 0
	|	И Номенклатура.Наименование ПОДОБНО &Наименование) 
	|	ИЛИ
	|	(Номенклатура.ВидНоменклатуры = &ВидНоменклатуры 
	|	И ДЛИНАСТРОКИ(&Наименование) = 0)";

	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат  Выборка;
КонецФункции

Функция ИсточникиФинансированияПоВиду(Знач ВидИсточникаФинасирования, Знач Наименование = "") Экспорт

	Запрос = НовыЙ Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсточникиДенежныхСредств.Ссылка
	|ИЗ
	|	Справочник.ИсточникиДенежныхСредств КАК ИсточникиДенежныхСредств
	|ГДЕ
	|	(ИсточникиДенежныхСредств.ВидИсточника = &ВидИсточника
	|	И ДЛИНАСТРОКИ(&Наименование) <> 0
	|	И ИсточникиДенежныхСредств.Наименование ПОДОБНО &Наименование) 
	|	ИЛИ
	|	(ИсточникиДенежныхСредств.ВидИсточника = &ВидИсточника 
	|	И ДЛИНАСТРОКИ(&Наименование) = 0)";

	Запрос.УстановитьПараметр("ВидИсточника", ВидИсточникаФинасирования);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат  Выборка;
КонецФункции

Функция ПолучитьЕд_измПоСсылкеНаТовар(Знач Товар) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка",Товар.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда 
		ЕдИзм= Выборка.ЕдиницаИзмерения;
		Возврат  ЕдИзм;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСсылкуНаСправочник(Параметры) Экспорт
	Возврат Неопределено; 
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
