


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуга;
	РазрешитьПовторыВТЧ = Ложь;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыКоммунальныеУслуги

&НаКлиенте
Процедура КоммунальныеУслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначенияОтбора = Новый Структура("Ссылка",ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНоменклатуры));
	ПараметрФормы = Новый Структура("Отбор", ЗначенияОтбора);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КоммунальныеУслугиУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если СтрДлина(Текст)>2 Тогда 
		ДанныеВыбора = Новый СписокЗначений();
		СписокУслуг = ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНоменклатуры,"%" + Текст + "%");
		ДанныеВыбора.ЗагрузитьЗначения(СписокУслуг);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоммунальныеУслугиСуммаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПодсчетСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура КоммунальныеУслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.КоммунальныеУслуги.ТекущиеДанные;
	Если Не РазрешитьПовторыВТЧ Тогда
		Для Каждого строка из Объект.КоммунальныеУслуги Цикл 
			Если строка.Услуга = ВыбранноеЗначение Тогда 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Данная услуга уже имеется в списке данного документа!";
				Сообщение.УстановитьДанные(строка);
				Сообщение.Поле ="Услуга";
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ТекущиеДанные.Услуга = ВыбранноеЗначение;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
Процедура ПодсчетСуммыДокумента()
	СуммаДокумента = 0;
	Для Каждого строка Из Объект.КоммунальныеУслуги Цикл 
		СуммаДокумента = СуммаДокумента + строка.Сумма;
	КонецЦикла; 
	Объект.СумаДокумента = СуммаДокумента;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
